OdCmColorBase.colorNameForDisplay
\details
Returns the display color name of the database color object.
\remarks
For named colors, this is the same as colorName(). For unnamed colors, it is
an 'appropriate' name.
\sa
Example of Working with the Database ColorColor Functionality as a Book Name

OdCmColorBase.bookName
\details
Returns the book name of the database color object.
\sa
Example of Working with the Database ColorColor Functionality as a Book Name

OdCmColorBase.colorName
\details
Returns the color name of the database color object.
\sa
Example of Working with the Database ColorColor Functionality as a Book Name

OdCmColorBase.setNames(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Converts to the named color and sets the color name and book name for the
database color object.
If the book name is an empty string, the method sets the book name to
UNNAMED.
If the color name is an empty string, the method ignores the specified
values.
If the book name and the color name are empty strings, the method
converts the database color object to the unnamed color.
\param colorName [in] Color name as a string value.
\param bookName  [in] Book name as a string value.
\returns
Returns true if and only if the conversion is successful.
\sa
Example of Working with the Database ColorColor Functionality as a Book NameColor Functionality as an Integer-value

OdCmColorBase.setColorIndex(System.UInt16)
\details
Sets the color index (ACI) of a color palette and sets the color method
to byACI for the database color object.
\param colorIndex [in]  An integer value that is the index of the color in a palette.
\remarks
The color index can be a one of the following:
NameValueDescription
kACIbyBlock       0               Sets the color method to byBlock.
kACIRed           1               Red.
kACIYellow        2               Yellow.
kACIGreen         3               Green.
kACICyan          4               Cyan.
kACIBlue          5               Blue.
kACIMagenta       6               Magenta.
kACIforeground    7               Sets the color method to Foreground.
..                8-255           Defined by display device.
kACIbyLayer       256             Sets the color method to byLayer.
kACInone          257             Sets the color method to None.
\sa
Example of Working with the Database ColorMethods of the Color DefinitionColor Functionality as an ACI-value

OdCmColorBase.colorIndex
\details
Returns the color index (ACI) of the database color object.
\remarks
The color index can be one of the following:
NameValueDescription
kACIbyBlock       0               Sets the color method to byBlock.
kACIRed           1               Red.
kACIYellow        2               Yellow.
kACIGreen         3               Green.
kACICyan          4               Cyan.
kACIBlue          5               Blue.
kACIMagenta       6               Magenta.
kACIforeground    7               Sets the color method to Foreground.
..                8-255           Defined by display device.
kACIbyLayer       256             Sets the color method to byLayer.
kACInone          257             Sets the color method to None.
\sa
Example of Working with the Database ColorMethods of the Color DefinitionColor Functionality as an ACI-value

OdCmColorBase.blue
\details
Returns the blue color component of the database color object as a value in
the range from 0 to 255.
\sa
Example of Working with the Database ColorColor Functionality as an RGB-value

OdCmColorBase.green
\details
Returns the green color component of the database color object as a value in
the range from 0 to 255.
\sa
Example of Working with the Database ColorColor Functionality as an RGB-value

OdCmColorBase.red
\details
Returns the red color component of the database color object as a value in
the range from 0 to 255.
\sa
Example of Working with the Database ColorColor Functionality as an RGB-value

OdCmColorBase.setBlue(System.Byte)
\details
Sets the blue color component for the database color object.
\param blue [in] Blue component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Database ColorColor Functionality as an RGB-value

OdCmColorBase.setGreen(System.Byte)
\details
Sets the green color component for the database color object.
\param green [in] Green component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Database ColorColor Functionality as an RGB-value

OdCmColorBase.setRed(System.Byte)
\details
Sets the red color component for the database color object.
\param red [in]  Red component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Database ColorColor Functionality as an RGB-value

OdCmColorBase.setRGB(System.Byte,System.Byte,System.Byte)
\details
Sets the red, green, and blue color components and the color method to byColor
for the database color object.
\param red   [in] Red component as an integer value in the range from 0 to 255.
\param green [in] Green component as an integer value in the range from 0 to 255.
\param blue  [in] Blue component as an integer value in the range from 0 to 255.
\sa
Example of Working with the Database ColorMethods of the Color DefinitionColor Functionality as an RGB-value

OdCmColorBase.setColor(System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Sets the color method and color components for the database color object as
an integer value.
\param color [in] A packed 32-bit integer value that specifies the color method and color components.
\sa
Example of Working with the Database ColorMethods of the Color DefinitionColor Functionality as an Integer-value

OdCmColorBase.color
\details
Returns the packed 32-bit integer value that stores the color method and
color components of the database color object.
\sa
Example of Working with the Database ColorMethods of the Color DefinitionColor Functionality as an Integer-value

OdCmColorBase.isByDgnIndex
\details
Checks whether the color method is byDgnIndex for the database color object
and returns true if and only if the color method is set to kByDgnIndex,
otherwise it returns false.
\sa
Example of Working with the Database ColorMethods of the Color Definition

OdCmColorBase.isForeground
\details
Checks whether the color method is Foreground for the database color object
and returns true if and only if the color method is set to kForeground or
kACIforeground, otherwise it returns false.
\sa
Example of Working with the Database ColorMethods of the Color Definition

OdCmColorBase.isByACI
\details
Checks whether the color method is byACI for the database color object and
returns true if and only if the color method is set to kByACI, otherwise it
returns false.
\remarks
This method returns true for ACI values of 0 (ByBlock), 7 (ByForeground),
256 (ByLayer), and 257 (None).
\sa
Example of Working with the Database ColorMethods of the Color Definition

OdCmColorBase.isByBlock
\details
Checks whether the color method is byBlock for the database color object and
returns true if and only if the color method is set to kByBlock or was set
to kACIbyBlock, otherwise it returns false.
\sa
Example of Working with the Database ColorMethods of the Color Definition

OdCmColorBase.isByLayer
\details
Checks whether the color method is byLayer for the database color object and
returns true if and only if the color method is set to kByLayer or was set
to kACIbyLayer, otherwise it returns false.
\sa
Example of Working with the Database ColorMethods of the Color Definition

OdCmColorBase.isByColor
\details
Checks whether the color method is byColor for the database color object and
returns true if and only if the color method is set to kByColor, otherwise
it returns false.
\sa
Example of Working with the Database ColorMethods of the Color Definition

OdCmColorBase.setColorMethod(OdCmEntityColor.ColorMethod)
\details
Sets the color method for the database color object as a value of the
ColorMethod enumeration.
\param colorMethod [in]  color method as the ColorMethod enumeration.
\remarks
The color method can be one of the following:
NameValueDescription
kByLayer       0xC0            Color is specified by the layer object on which the object resides.
kByBlock       0xC1            Color is specified by the block object in which the object is contained.
kByColor       0xC2            Color is specified by an RGB value.
kByACI         0xC3            Color is specified by an index (ACI) of a color palette.
kByPen         0xC4            Color is specified by an index of a pen color table.
kForeground    0xC5            Color is the same as the foreground color.
kByDgnIndex    0xC7            Color is specified by an index of a .dgn color table.
kNone          0xC8            Color is absent (object is clear).
\remarks
Use of this method by third-party applications is neither supported nor
recommended.
\sa
Example of Working with the Database ColorMethods of the Color Definition

OdCmColorBase.colorMethod
\details
Returns the color method of the database color object as a value of the
ColorMethod enumeration.
\remarks
The color method can be one of the following:
NameValueDescription
kByLayer       0xC0            Color is specified by the layer object on which the object resides.
kByBlock       0xC1            Color is specified by the block object in which the object is contained.
kByColor       0xC2            Color is specified by an RGB value.
kByACI         0xC3            Color is specified by an index (ACI) of a color palette.
kByPen         0xC4            Color is specified by an index of a pen color table.
kForeground    0xC5            Color is the same as the foreground color.
kByDgnIndex    0xC7            Color is specified by an index of a .dgn color table.
kNone          0xC8            Color is absent (object is clear).
Use of this method by third-party applications is neither supported nor
recommended.
\sa
Example of Working with the Database ColorMethods of the Color Definition